// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Scansione su computer";

// Restore alert message
"RESTORE_TITLE" = "Si desidera ripristinare le impostazioni?";
"RESTORE_MSG" = "Se si continua, tutti i collegamenti di scansione verranno ripristinati al loro stato originario. Premere Annulla per lasciare inalterati i collegamenti oppure premere Ripristina per ripristinare le impostazioni predefinite dei collegamenti.";
"RESTORE_BUTTON_TITLE" = "Ripristina";

"DEFAULT_TASK_CAPTION" = "Nome attività";
"DONE" = "Fine";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Attività indisponibile";
"TASK_NOT_FOUND_DESC" = "L'attività “%@” che si trova sul dispositivo non è disponibile sul sistema. Selezionare un'altra attvità.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Impossibile copiare il flusso di lavoro";
"COPY_WORKFLOWS_DESC" = "Impossibile copiare i flussi di lavoro nella cartella di dominio del dispositivo utente";

"DEVICE_NOT_FOUND_TITLE" = "Dispositivo non trovato";
"DEVICE_NOT_FOUND_DESC" = "Si è verificato un problema di comunicazione con il dispositivo. Verificare che il dispositivo sia acceso e correttamente collegato, quindi riprovare.";

"COMPUTER_NAME_INFO_TITLE" = "Il campo “Nome del computer” consente di immettere un nome da assegnare al computer, che verrà poi visualizzato sul dispositivo HP."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "Il numero di caratteri che è possibile immettere dipende dal dispositivo utilizzato.";

"UNKNOWN_ERROR_TITLE" = "Errore sconosciuto";
"UNKNOWN_ERROR_DESC" = "Si è verificato un errore sconosciuto durante l'aggiornamento del dispositivo. Verificare che il dispositivo sia acceso e correttamente collegato.";

"OK" = "OK";
"CANCEL" = "Annulla";

"MOREINFO_TITLE" = "Ulteriori informazioni";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Gestione collegamenti scansione"; // Title
"SSM_SHORT_DESC" = "Usare i collegamenti di scansione per eseguire le attività di scansione più comuni direttamente dai comandi posti sul pannello anteriore del dispositivo HP."; // short description
"YOUR_COMPUTER_NAME" = "Nome del computer:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Cambia...";
"MORE_INFO_BTN_TITLE" = "Ulteriori informazioni...";
"RESTORE_BTN_TITLE" = "Ripristina predefinite";
"TEST_BTN_TITLE" = "Test...";
"EDIT_BTN_TITLE" = "Modifica...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "Non si dispone dei privilegi di accesso appropriati per la cartella “%@”. Per visualizzare o modificare i privilegi di accesso, selezionare l'elemento in Finder e scegliere Archivio > Informazioni."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Errore";
"ERROR_UNKNOWN_DESC" = "Si è verificato un errore sconosciuto.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Combinazione di tasti non trovata";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "Impossibile trovare la combinazione di tasti %1$@ per il dispositivo %2$@. Provare a reinstallare il software.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Impossibile creare il carico di lavoro";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Si è verificato un errore durante la creazione del carico di lavoro. Provare di nuovo.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Errore durante la creazione della directory";
"ERROR_CREATING_DIR_DESC" = "Si è verificato un errore durante la creazione della directory %@. Verificare i privilegi di accesso di cui si dispone per la cartella principale e riprovare";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Si è verificato un errore durante l'apertura del flusso di lavoro %@ in Automator. Il flusso di lavoro non è stato trovato nel percorso originario.";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Collegamento per la scansione non supportato";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Il collegamento per la scansione selezionato non può essere eseguito in quanto non riconosciuto dal software. Selezionare un altro collegamento e riprovare.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Fare clic per modificare il nome del computer";
"TIP_FOR_EDIT_BTN" = "Modifica l'attività selezionata";
"TIP_FOR_TEST_BTN" = "Esegue l'attività selezionata";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Il nome del computer è";
"COMPUTER_NAME_DESCRIPTION" = "Quando si avvia una scansione dal dispositivo HP, potrebbe essere necessario selezionare il computer nell'elenco di computer host abilitati per la scansione.";
"COMPUTER" = "Computer";
"COMPUTERS" = "Computer";

"COMMUNICATION_ERROR" = "Impossibile stabilire la comunicazione con lo scanner. Accertarsi che il dispositivo sia acceso e controllare la connessione; verificare che la rete funzioni correttamente. Si ricordi che sul dispositivo deve essere abilitato Bonjour.";
"INSTALLATION_ERROR" = "Impossibile trovare su questo computer il software HP necessario per la scansione su computer. Scaricare ed installare il più recente software HP consigliato per questo dispositivo da http://www.hp.com/support e riprivare";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Impossibile abilitare scansione su computer";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Scansione su computer consente di avviare la scansione dal pannello anteriore del dispositivo HP e inviare automaticamente l'output al computer.";

HSDScanActionNotFoundTitle = "Impossibile trovare la scansione";
HSDScanActionNotFoundDescription = "La scansione non è stata registrata. Avviare l'applicazione HP Scan da '%@' per registrare automaticamente la scansione.";
